# IsAllowedDimensionStyleType Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
MultiReferenceAnnotationOptions..::..IsAllowedDimensionStyleType Method
MultiReferenceAnnotationOptions Class See Also
---
Only Linear and LinearFixed dimension style types are allowed for new MultiReferenceAnnotations.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public bool IsAllowedDimensionStyleType(
	DimensionStyleType dimensionStyleType
)
```

Visual Basic
---
```text
Public Function IsAllowedDimensionStyleType ( _
	dimensionStyleType As DimensionStyleType _
) As Boolean
```

Visual C++
---
```text
public:
bool IsAllowedDimensionStyleType(
	DimensionStyleType dimensionStyleType
)
```

# ### Parameters
dimensionStyleType
    Type: Autodesk.Revit.DB..::..DimensionStyleType The dimension style type to test.
# ### Return Value
True if the type is allowed.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | A value passed for an enumeration argument is not a member of that enumeration |

# See Also
MultiReferenceAnnotationOptions Class
Autodesk.Revit.DB Namespace